## Final Project Submission

Please fill out:
* Student name: 
* Student pace: self paced / part time / full time
* Scheduled project review date/time: 
* Instructor name: 
* Blog post URL:

In [2]:
# Your code here - remember to use markdown cells for comments as well!

In [3]:
# Importing the necessary libraries
import pandas as pd 
import numpy as np
import sqlite3
import matplotlib.pyplot as plt

In [4]:
bom_df = pd.read_csv("bom.movie_gross.csv")
bom_df

,title,studio,domestic_gross,foreign_gross,year
0,Toy Story 3,BV,415000000.0,652000000,2010
1,Alice in Wonderland (2010),BV,334200000.0,691300000,2010
2,Harry Potter and the Deathly Hallows Part 1,WB,296000000.0,664300000,2010
3,Inception,WB,292600000.0,535700000,2010
4,Shrek Forever After,P/DW,238700000.0,513900000,2010
...,...,...,...,...,...
3382,The Quake,Magn.,6200.0,NaN,2018
3383,Edward II (2018 re-release),FM,4800.0,NaN,2018
3384,El Pacto,Sony,2500.0,NaN,2018
3385,The Swan,Synergetic,2400.0,NaN,2018
3386,An Actor Prepares,Grav.,1700.0,NaN,2018

In [5]:
#Connect to the SQlite database for im.db
conn = sqlite3.connect("im.db")
cursor = conn.cursor()
cursor.execute("SELECT name FROM sqlite_master WHERE type='table'")
tables = cursor.fetchall()
tables

[('movie_basics',),
 ('directors',),
 ('known_for',),
 ('movie_akas',),
 ('movie_ratings',),
 ('persons',),
 ('principals',),
 ('writers',)]

In [6]:
query = pd.read_sql("SELECT * FROM movie_basics", conn)
query

,movie_id,primary_title,original_title,start_year,runtime_minutes,genres
0,tt0063540,Sunghursh,Sunghursh,2013,175.0,"Action,Crime,Drama"
1,tt0066787,One Day Before the Rainy Season,Ashad Ka Ek Din,2019,114.0,"Biography,Drama"
2,tt0069049,The Other Side of the Wind,The Other Side of the Wind,2018,122.0,Drama
3,tt0069204,Sabse Bada Sukh,Sabse Bada Sukh,2018,NaN,"Comedy,Drama"
4,tt0100275,The Wandering Soap Opera,La Telenovela Errante,2017,80.0,"Comedy,Drama,Fantasy"
...,...,...,...,...,...,...
146139,tt9916538,Kuambil Lagi Hatiku,Kuambil Lagi Hatiku,2019,123.0,Drama
146140,tt9916622,Rodolpho TeÃ³philo - O Legado de um Pioneiro,Rodolpho TeÃ³philo - O Legado de um Pioneiro,2015,NaN,Documentary
146141,tt9916706,Dankyavar Danka,Dankyavar Danka,2013,NaN,Comedy
146142,tt9916730,6 Gunn,6 Gunn,2017,116.0,None
146143,tt9916754,Chico Albuquerque - RevelaÃ§Ãµes,Chico Albuquerque - RevelaÃ§Ãµes,2013,NaN,Documentary

In [7]:
query = pd.read_sql("SELECT * FROM movie_ratings", conn)
query

         movie_id  averagerating  numvotes
0      tt10356526            8.3        31
1      tt10384606            8.9       559
2       tt1042974            6.4        20
3       tt1043726            4.2     50352
4       tt1060240            6.5        21
...           ...            ...       ...
73851   tt9805820            8.1        25
73852   tt9844256            7.5        24
73853   tt9851050            4.7        14
73854   tt9886934            7.0         5
73855   tt9894098            6.3       128

[73856 rows x 3 columns]

In [8]:
movie_budgets = pd.read_csv("tn.movie_budgets.csv")
movie_budgets

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross
0,1,"Dec 18, 2009",Avatar,"$425,000,000","$760,507,625","$2,776,345,279"
1,2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,"$410,600,000","$241,063,875","$1,045,663,875"
2,3,"Jun 7, 2019",Dark Phoenix,"$350,000,000","$42,762,350","$149,762,350"
3,4,"May 1, 2015",Avengers: Age of Ultron,"$330,600,000","$459,005,868","$1,403,013,963"
4,5,"Dec 15, 2017",Star Wars Ep. VIII: The Last Jedi,"$317,000,000","$620,181,382","$1,316,721,747"
...,...,...,...,...,...,...
5777,78,"Dec 31, 2018",Red 11,"$7,000",$0,$0
5778,79,"Apr 2, 1999",Following,"$6,000","$48,482","$240,495"
5779,80,"Jul 13, 2005",Return to the Land of Wonders,"$5,000","$1,338","$1,338"
5780,81,"Sep 29, 2015",A Plague So Pleasant,"$1,400",$0,$0
5781,82,"Aug 5, 2005",My Date With Drew,"$1,100","$181,041","$181,041"

In [9]:
movies = pd.read_csv("tmdb.movies.csv")
movies

,Unnamed: 0,genre_ids,id,original_language,original_title,popularity,release_date,title,vote_average,vote_count
0,0,"[12, 14, 10751]",12444,en,Harry Potter and the Deathly Hallows: Part 1,33.533,2010-11-19,Harry Potter and the Deathly Hallows: Part 1,7.7,10788
1,1,"[14, 12, 16, 10751]",10191,en,How to Train Your Dragon,28.734,2010-03-26,How to Train Your Dragon,7.7,7610
2,2,"[12, 28, 878]",10138,en,Iron Man 2,28.515,2010-05-07,Iron Man 2,6.8,12368
3,3,"[16, 35, 10751]",862,en,Toy Story,28.005,1995-11-22,Toy Story,7.9,10174
4,4,"[28, 878, 12]",27205,en,Inception,27.920,2010-07-16,Inception,8.3,22186
...,...,...,...,...,...,...,...,...,...,...
26512,26512,"[27, 18]",488143,en,Laboratory Conditions,0.600,2018-10-13,Laboratory Conditions,0.0,1
26513,26513,"[18, 53]",485975,en,_EXHIBIT_84xxx_,0.600,2018-05-01,_EXHIBIT_84xxx_,0.0,1
26514,26514,"[14, 28, 12]",381231,en,The Last One,0.600,2018-10-01,The Last One,0.0,1
26515,26515,"[10751, 12, 28]",366854,en,Trailer Made,0.600,2018-06-22,Trailer Made,0.0,1
26516,26516,"[53, 27]",309885,en,The Church,0.600,2018-10-05,The Church,0.0,1

# Data Cleaning

1. Handling Missing Values

In [40]:
#Check data types of 'domestic_gross' and 'foreign_gross' columns
print(bom_df[['domestic_gross', 'foreign_gross']].dtypes)

#Convert 'doemstic_gross' and 'foreign_gross' to numeric after removing commas, handling errors with 'coerce'
bom_df['domestic_gross'] = pd.to_numeric(bom_df['domestic_gross'].astype(str).str.replace(',', '', regex=False), errors ='coerce')
bom_df['foreign_gross'] = pd.to_numeric(bom_df['foreign_gross'].astype(str).str.replace(',', '', regex=False), errors ='coerce')

#Fill missing values in 'doemstic_gross' and 'foreign_gross' with the median
bom_df['domestic_gross'].fillna(bom_df['domestic_gross'].median(), inplace=True)
bom_df['foreign_gross'].fillna(bom_df['foreign_gross'].median(), inplace=True)

#Handle missing values in studio column and fill missing values with 'Unkown'
if 'studio' in bom_df.columns:
    bom_df['studio'].fillna('Unknown', inplace=True)

# Handle missing values in imdb_data dataframe, checking if the columns exist
if 'original_title' in imdb_data.columns:
    imdb_data['original title'].fillna('Unknown', inplace=True)
    
if 'runtime_minutes' in imdb_data.columns:
    imdb_data['runtime_minutes'].fillna(imdb_data['runtime_minutes'].median(), inplace=True)        

#Drop 'Unnamed: 0' column in movies if it exists
movies.drop(columns=['Unnamed: 0'], inplace=True, errors= 'ignore')

#Final check for missing values in each dataset
print("\n Check for missing values:")
print("\nbom_df:", bom_df.isnull().sum())
print("\nimdb_data:", imdb_data.isnull().sum())
print("\nmovies:", movies.isnull().sum())
print("\nmovie_budgets:", movie_budgets.isnull().sum())

domestic_gross    float64
foreign_gross     float64
dtype: object

 Check for missing values:

bom_df: title             0
studio            0
domestic_gross    0
foreign_gross     0
year              0
dtype: int64

imdb_data: movie_id     0
person_id    0
dtype: int64

movies: genre_ids            0
id                   0
original_language    0
original_title       0
popularity           0
release_date         0
title                0
vote_average         0
vote_count           0
dtype: int64

movie_budgets: id                   0
release_date         0
movie                0
production_budget    0
domestic_gross       0
worldwide_gross      0
dtype: int64

2. Removing Duplicates

In [39]:
#Display the shape of the dataframes before removing duplicates
print("Before removing duplicates (bom_df):", bom_df.shape)
print("Before removing duplicates (movie_budgets):", movie_budgets.shape)

#Count the number of duplicate rows in both dataframes
num_duplicates_bom = bom_df.duplicated().sum()
print("Number of duplicate rows in bom_df:", num_duplicates_bom)

num_duplicates_budgets = movie_budgets.duplicated().sum()
print("Number of duplicate rows in movie_budgets:", num_duplicates_budgets)

#Remove duplicate rows from both dataframes
bom_df.drop_duplicates(inplace=True)
movie_budgets.drop_duplicates(inplace=True)

#Display the shape of the dataframes after removing duplicates
print("After removing duplicates (bom_df):", bom_df.shape)
print("After removing duplicates (movie_budgets):", movie_budgets.shape)

#Save the cleaned dataframes to new CSV files
bom_df.to_csv('bom.movies_gross.csv', index=False)
movie_budgets.to_csv('tn.movie_budgets.csv', index=False)

Before removing duplicates (bom_df): (3387, 5)
Before removing duplicates (movie_budgets): (5782, 6)
Number of duplicate rows in bom_df: 0
Number of duplicate rows in movie_budgets: 0
After removing duplicates (bom_df): (3387, 5)
After removing duplicates (movie_budgets): (5782, 6)